name: "CASIA"
layer {
  name: "pair_data1"
  type: "ImageData"
  top: "pair_data1"
  top: "label1"
  image_data_param {
    source: "G:/100/list.txt"
    is_color: false
	batch_size: 40
	shuffle: true
  }
  transform_param { 
    mean_file: "examples/siamese/96.8/mean.proto"
	scale: 0.0078125
  }
  include: { phase: TRAIN }
}
layer {
  name: "attribute_data"
  type: "MultiLabelImageData"
  top: "attribute_data"
  top: "atrribute_label"
  image_data_param {
    #format:   0001.jpg 0 1 0 1 0 1 ...
    source: "G:/face-celebrity/list_attr_celeba_train.txt"
    is_color: false
    batch_size: 40
  }
  transform_param { 
    mean_file: "D:/ThirdPartyLibrary/caffe/examples/siamese/96.8/mean.proto"
	scale: 0.0078125
	mirror: true
  }
  include: { phase: TRAIN }
}
layer {
  name: "pair_data1"
  type: "ImageData"
  top: "pair_data1"
  top: "label1"
  image_data_param {
    source: "G:/100/list.txt"
    is_color: false
	batch_size: 40
	shuffle: true
  }
  transform_param { 
    mean_file: "examples/siamese/96.8/mean.proto"
	scale: 0.0078125
  }
  include: { phase: TEST }
}
layer {
  name: "attribute_data"
  type: "MultiLabelImageData"
  top: "attribute_data"
  top: "atrribute_label"
  image_data_param {
    source: "G:/face-celebrity/list_attr_celeba_val.txt"
    is_color: false
    batch_size: 40
  }
  transform_param { 
    mean_file: "D:/ThirdPartyLibrary/caffe/examples/siamese/96.8/mean.proto"
	scale: 0.0078125
  }
  include: { phase: TEST }
}
layer {
  name: "concat_data"
  type: "Concat"
  bottom: "pair_data1"
  bottom: "attribute_data"
  top: "concat_data"
  concat_param {
    concat_dim: 0
  }
}
layer {
  name: "conv11"
  type: "Convolution"
  bottom: "concat_data"
  top: "conv11"
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv11_w"
  }
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv11_b"
  }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
	  alpha: 0.25
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu11"
  type: "Insanity"
  bottom: "conv11"
  top: "conv11"
  insanity_param{
    lb: 3
	ub: 5
  }
}
layer {
  name: "conv12"
  type: "Convolution"
  bottom: "conv11"
  top: "conv12"
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv12_w"
  }
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv12_b"
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
	pad: 1
    weight_filler {
      type: "msra"
	  alpha: 0.25
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu12"
  type: "Insanity"
  bottom: "conv12"
  top: "conv12"
  insanity_param{
    lb: 3
	ub: 5
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv12"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv21"
  type: "Convolution"
  bottom: "pool1"
  top: "conv21"
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv21_w"
  }
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv21_b"
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
	pad: 1
    weight_filler {
      type: "msra"
	  alpha: 0.2
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu21"
  type: "Insanity"
  bottom: "conv21"
  top: "conv21"
  insanity_param{
    lb: 3
	ub: 8
  }
}
layer {
  name: "conv22"
  type: "Convolution"
  bottom: "conv21"
  top: "conv22"
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv22_w"
  }
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv22_b"
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
	pad: 1
    weight_filler {
      type: "msra"
	  alpha: 0.2
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu22"
  type: "Insanity"
  bottom: "conv22"
  top: "conv22"
  insanity_param{
    lb: 3
	ub: 8
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv22"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv31"
  type: "Convolution"
  bottom: "pool2"
  top: "conv31"
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv31_w"
  }
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv31_b"
  }
  convolution_param {
    num_output: 96
    kernel_size: 3
    stride: 1
	pad: 1
    weight_filler {
      type: "msra"
	  alpha: 0.2
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu31"
  type: "Insanity"
  bottom: "conv31"
  top: "conv31"
  insanity_param{
    lb: 3
	ub: 8
  }
}
layer {
  name: "conv32"
  type: "Convolution"
  bottom: "conv31"
  top: "conv32"
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv32_w"
  }
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv32_b"
  }
  convolution_param {
    num_output: 192
    kernel_size: 3
    stride: 1
	pad: 1
    weight_filler {
      type: "msra"
	  alpha: 0.2
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu32"
  type: "Insanity"
  bottom: "conv32"
  top: "conv32"
  insanity_param{
    lb: 3
	ub: 8
  }
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv32"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv41"
  type: "Convolution"
  bottom: "pool3"
  top: "conv41"
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv41_w"
  }
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv41_b"
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
	pad: 1
    weight_filler {
      type: "msra"
	  alpha: 0.1386
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu41"
  type: "Insanity"
  bottom: "conv41"
  top: "conv41"
  insanity_param{
    lb: 5
	ub: 10
  }
}
layer {
  name: "conv42"
  type: "Convolution"
  bottom: "conv41"
  top: "conv42"
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv42_w"
  }
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv42_b"
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    stride: 1
	pad: 1
    weight_filler {
      type: "msra"
	  alpha: 0.1386
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu42"
  type: "Insanity"
  bottom: "conv42"
  top: "conv42"
  insanity_param{
    lb: 5
	ub: 10
  }
}
layer {
  name: "slice_conv42"
  type: "Slice"
  bottom: "conv42"
  slice_param {
    slice_point: 40
	axis: 0
  }
  top: "identity_feature"
  top: "attribute_feature"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "identity_feature"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv51"
  type: "Convolution"
  bottom: "pool4"
  top: "conv51"
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv51_w"
  }
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv51_b"
  }
  convolution_param {
    num_output: 160
    kernel_size: 3
    stride: 1
	pad: 1
    weight_filler {
      type: "msra"
	  alpha: 0.1386
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu51"
  type: "Insanity"
  bottom: "conv51"
  top: "conv51"
  insanity_param{
    lb: 5
	ub: 10
  }
}
layer {
  name: "conv52"
  type: "Convolution"
  bottom: "conv51"
  top: "conv52"
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv52_w"
  }
  param {
    lr_mult: 1
	decay_mult: 0
	name: "conv52_b"
  }
  convolution_param {
    num_output: 320
    kernel_size: 3
    stride: 1
	pad: 1
    weight_filler {
      type: "msra"
	  alpha: 0.1386
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu52"
  type: "ReLU"
  bottom: "conv52"
  top: "conv52"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv52"
  top: "pool5"
  pooling_param {
    pool: AVE
    kernel_size: 7
    stride: 1
  }
}
layer {
  name: "drop5"
  type: "Dropout"
  bottom: "pool5"
  top: "pool5"
  dropout_param {
    dropout_ratio: 0.6
  }
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool5"
  top: "ip1"
  param {
    lr_mult: 1
	decay_mult: 1e-5
	name: "ip1_w"
  }
  param {
    lr_mult: 1
	decay_mult: 0
	name: "ip1_b"
  }
  inner_product_param {
    num_output: 10575
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "identity_accuracy"
  type: "Accuracy"
  bottom: "ip1"
  bottom: "label1"
  top: "identity_accuracy"
  include: { phase: TEST }
}
layer {
  name: "softmax_loss1"
  type: "SoftmaxWithLoss"
#  hinge_loss_param {
#    norm: L2
#  }
  loss_weight: 1
  bottom: "ip1"
  bottom: "label1"
  top: "softmax_loss1"
}
layer {
  name: "attribute_ip1"
  type: "InnerProduct"
  bottom: "attribute_feature"
  top: "attribute_ip1"
  param {
    lr_mult: 1
	decay_mult: 1e-5
	name: "attribute_ip1_w"
  }
  param {
    lr_mult: 1
	decay_mult: 0
	name: "attribute_ip1_b"
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu_attribute_ip1"
  type: "Insanity"
  bottom: "attribute_ip1"
  top: "attribute_ip1"
  insanity_param{
    lb: 5
	ub: 10
  }
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "attribute_ip1"
  top: "attribute_ip1"
  dropout_param {
    dropout_ratio: 0.6
  }
}
layer {
  name: "attribute_ip2"
  type: "InnerProduct"
  bottom: "attribute_ip1"
  top: "attribute_ip2"
  param {
    lr_mult: 1
	decay_mult: 1e-5
	name: "attribute_ip2_w"
  }
  param {
    lr_mult: 1
	decay_mult: 0
	name: "attribute_ip2_b"
  }
  inner_product_param {
    num_output: 80
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "reshape_attribute"
  type: "Reshape"
  bottom: "attribute_ip2"
  top: "attribute_ip2"
  reshape_param {
    shape {
      dim: 0  # copy the dimension from below
      dim: 2
      dim: 40
      dim: -1 # infer it from the other dimensions
    }
  }
}
layer {
  name: "attribute_loss"
  type: "SoftmaxWithLoss"
  loss_weight: 0.02
  bottom: "attribute_ip2"
  bottom: "atrribute_label"
  top: "attribute_loss"
  softmax_param {
    axis: 1
  }
  
#  include: { phase: TRAIN }
}
layer {
  name: "attribute_accuracy"
  type: "Accuracy"
  bottom: "attribute_ip2"
  bottom: "atrribute_label"
  top: "attribute_accuracy"
  include: { phase: TEST }
  accuracy_param {
    axis: 1
  }
}
